Revit 2027 API
ColorFillScheme.CanDefineByRange Method
 Checks whether the scheme entries can be explained by range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanDefineByRange()
Public Function CanDefineByRange As Boolean
public:
bool CanDefineByRange()
member CanDefineByRange : unit -> bool
Return Value
Boolean
 Returns true ifthe scheme entries can be explained by range, false otherwise.
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace